Q1: Create a dataframe which contains information of a company's products:

prod_name price monthly_demand brand

In [1]:
import pandas as pd

In [2]:
data = {
    'prod_name': ['g1', 'g2', 'c1', 'c2', 'c3', 'f1', 'f2'],
    'price': [45, 25, 75, 35, 89, 20, 55],
    'monthly_demand': [1200, 2500, 200, 1850, 120, 3500, 545],
    'brand': ['z', 'x', 'x', 'y', 'z', 'y', 'z']
}

In [3]:
df = pd.DataFrame(data)
df

  prod_name  price  monthly_demand brand
0        g1     45            1200     z
1        g2     25            2500     x
2        c1     75             200     x
3        c2     35            1850     y
4        c3     89             120     z
5        f1     20            3500     y
6        f2     55             545     z

a: Add a column to calculate monthly revenue of each product

In [7]:
df['monthly_revenue'] = df['price'] * df['monthly_demand']
df

  prod_name  price  monthly_demand brand  monthly_revenue
0        g1     45            1200     z            54000
1        g2     25            2500     x            62500
2        c1     75             200     x            15000
3        c2     35            1850     y            64750
4        c3     89             120     z            10680
5        f1     20            3500     y            70000
6        f2     55             545     z            29975

b: Calculate total monthly revenue generated by brand z

In [8]:
total_revenue_z = df[df['brand'] == 'z']['monthly_revenue'].sum()
total_revenue_z

94655

c: Create a column called revenue share which includes monthly revenue share of each product

In [9]:
total_revenue = df['monthly_revenue'].sum()
df['revenue_share'] = df['monthly_revenue'] / total_revenue
df

  prod_name  price  monthly_demand brand  monthly_revenue  revenue_share
0        g1     45            1200     z            54000       0.175950
1        g2     25            2500     x            62500       0.203646
2        c1     75             200     x            15000       0.048875
3        c2     35            1850     y            64750       0.210977
4        c3     89             120     z            10680       0.034799
5        f1     20            3500     y            70000       0.228084
6        f2     55             545     z            29975       0.097669

d: Which brand does have the largest revenue share?

In [11]:
brand_revenue_share = df.groupby('brand')['monthly_revenue'].sum() / total_revenue
largest_revenue_share_brand = brand_revenue_share.idxmax()
largest_revenue_share_brand

'y'

Q2: Consider CRM dataset and answer these questions:

In [3]:
crm_data = {
    'customer_id': [1, 2, 3, 4, 5],
    'age': [24, 30, 22, 35, 40],
    'gender': ['female', 'male', 'female', 'female', 'male'],
    'marital_status': ['married', 'single', 'single', 'married', 'married'],
    'income': [35000, 50000, 42000, 31000, 60000],
    'employment_status': ['employed', 'employed', 'student', 'employed', 'self-employed'],
    'health_insurance': [True, True, False, True, True],
    'homeowner': [True, False, False, True, True],
    'vehicle_owner': [1, 0, 1, 2, 2]
}
crm_df = pd.DataFrame(crm_data)
crm_df

,customer_id,age,gender,marital_status,income,employment_status,health_insurance,homeowner,vehicle_owner
0,1,24,female,married,35000,employed,True,True,1
1,2,30,male,single,50000,employed,True,False,0
2,3,22,female,single,42000,student,False,False,1
3,4,35,female,married,31000,employed,True,True,2
4,5,40,male,married,60000,self-employed,True,True,2

a: Extract data of married customers with income above average

In [5]:
average_income = crm_df['income'].mean()
married_above_avg_income = crm_df[(crm_df['marital_status'] == 'married') & (crm_df['income'] > average_income)]
married_above_avg_income

,customer_id,age,gender,marital_status,income,employment_status,health_insurance,homeowner,vehicle_owner
4,5,40,male,married,60000,self-employed,True,True,2

b: What percentage of female customers are below 26?

In [6]:
female_below_26_percentage = (crm_df[(crm_df['gender'] == 'female') & (crm_df['age'] < 26)].shape[0] / crm_df[crm_df['gender'] == 'female'].shape[0]) * 100
female_below_26_percentage

66.66666666666666

c: What percentage of female customers above 30 are employed?

In [8]:
female_above_30_employed_percentage = (crm_df[(crm_df['gender'] == 'female') & (crm_df['age'] > 30) & (crm_df['employment_status'] == 'employed')].shape[0] / crm_df[(crm_df['gender'] == 'female') & (crm_df['age'] > 30)].shape[0]) * 100
female_above_30_employed_percentage

100.0

d: What percentage of customers who have health insurance are employed with income above average income?

In [9]:
employed_with_health_insurance_above_avg_income_percentage = (crm_df[(crm_df['health_insurance'] == True) & (crm_df['employment_status'] == 'employed') & (crm_df['income'] > average_income)].shape[0] / crm_df[crm_df['health_insurance'] == True].shape[0]) * 100
employed_with_health_insurance_above_avg_income_percentage

25.0

e: What percentage of customers who have health insurance are married males?

In [10]:
married_males_with_health_insurance_percentage = (crm_df[(crm_df['health_insurance'] == True) & (crm_df['marital_status'] == 'married') & (crm_df['gender'] == 'male')].shape[0] / crm_df[crm_df['health_insurance'] == True].shape[0]) * 100
married_males_with_health_insurance_percentage

25.0

f: What percentage of married customers have health insurance?

In [12]:
married_with_health_insurance_percentage = (crm_df[(crm_df['marital_status'] == 'married') & (crm_df['health_insurance'] == True)].shape[0] / crm_df[crm_df['marital_status'] == 'married'].shape[0]) * 100
married_with_health_insurance_percentage

100.0

g: Identify our top customers? (income > average, homeowner, and own at least one vehicle)

In [13]:
top_customers = crm_df[(crm_df['income'] > average_income) & (crm_df['homeowner'] == True) & (crm_df['vehicle_owner'] >= 1)]
top_customers

,customer_id,age,gender,marital_status,income,employment_status,health_insurance,homeowner,vehicle_owner
4,5,40,male,married,60000,self-employed,True,True,2